Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetTransactionNames
Returns names of the transactions associated with this event
Remarks:
Typically, there will be only one name in the array, because document changes mostly involve just one transaction
Returns:
The names of the transactions associated with this event
Since:
2011

Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetDocument
Returns document associated with this event
Returns:
The document associated with this event.
Since:
2011

Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetModifiedElementIds(Autodesk.Revit.DB.ElementFilter)
Returns set of elements  that were modified according to the given element filter.
filter:
The element filter to be applied.
Returns:
The set of ElementId for modified elements that pass the filter.
Returns empty set if no elements are found which pass the filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetModifiedElementIds
Returns set of elements that were modified.
Returns:
The set of ElementId for elements that were modified.
Since:
2011

Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetDeletedElementIds
Returns set of elements that were deleted from the document.
Returns:
The set of ElementId for elements that were deleted from the document.
Since:
2011

Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetAddedElementIds(Autodesk.Revit.DB.ElementFilter)
Returns set of newly added elements that pass the filter.
filter:
The element filter to be applied.
Returns:
The set of ElementId for newly added elements that pass the filter.
Returns empty set if no elements are found which pass the filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetAddedElementIds
Returns set of elements newly added to the document.
Returns:
The set of ElementId for elements newly added to the document.
Since:
2011

Autodesk.Revit.DB.Events.DocumentChangedEventArgs.Operation
The operation associated with this event
Since:
2011

Autodesk.Revit.DB.Events.DocumentChangedEventArgs
The event arguments used by the DocumentChanged event.
Since:
2011